Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery
The serialization structure for AnalysisLoadGroup query.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.Operation
The operation.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.LoadGroupId
Gets or sets the identifier of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.LoadsExist
Gets or sets the decomposed analysis loads exist flag (0 or 1).

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.LoadGroupType
Gets or sets the load group type.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery.LoadGroupTypeName
The name of the load group.